In [188]:
import pandas as pd

from sklearn import metrics
from sklearn.model_selection import train_test_split

from sklearn.tree import DecisionTreeClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.discriminant_analysis import LinearDiscriminantAnalysis as LDA

In [190]:
data2

     Unnamed: 0  PassengerId  Survived  ...  Embarked    Title  PassengerType
0             0            1         0  ...         S       Mr              4
1             1            2         1  ...         C      Mrs              4
2             2            3         1  ...         S     Miss              4
3             3            4         1  ...         S      Mrs              4
4             4            5         0  ...         S       Mr              4
..          ...          ...       ...  ...       ...      ...            ...
886         886          887         0  ...         S  Officer              4
887         887          888         1  ...         S     Miss              4
888         888          889         0  ...         S     Miss              2
889         889          890         1  ...         C       Mr              4
890         890          891         0  ...         Q       Mr              4

[891 rows x 15 columns]

In [189]:
data2 = pd.read_csv('/content/output.csv')
# data2.to_csv('train2.csv')

In [208]:
data2.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
SibSp            0
Parch            0
Fare             0
Embarked         0
Title            0
PassengerType    0
dtype: int64

In [192]:
print('null: ', data2['Ticket'].isnull().sum())
print('category:', data2['Ticket'].value_counts().sum())

null:  0
category: 891

In [193]:
print('null: ', data2['Cabin'].isnull().sum())
print('category: ', data2['Cabin'].value_counts().sum())

null:  687
category:  204

In [194]:

# data2['Embarked'].isnull().sum()
data2['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [196]:
nullC = data2.columns[data2.isnull().any()]
print(data2[data2["Title"].isnull()][nullC])
print(data2[data2["Embarked"].isnull()][nullC])

      Age Cabin Embarked Title
759  33.0   B77        S   NaN
822  38.0   NaN        S   NaN
      Age Cabin Embarked Title
61   38.0   B28      NaN  Miss
829  62.0   B28      NaN   Mrs

In [197]:
print(data2.loc[[759, 822, 61, 829]])

     Unnamed: 0  PassengerId  Survived  ...  Embarked Title  PassengerType
759         759          760         1  ...         S   NaN              4
822         822          823         0  ...         S   NaN              4
61           61           62         1  ...       NaN  Miss              4
829         829          830         1  ...       NaN   Mrs              4

[4 rows x 15 columns]

In [198]:
data2 = data2.drop([759, 822, 61, 829], axis=0)

In [207]:
# del data2['Name']
# del data2['Ticket']
# del data2['Cabin']
# del data2['Age']
del data2['Unnamed: 0']

In [200]:
# data2.isnull().sum()
# data2
data2['Title'].value_counts()

Mr         517
Miss       183
Mrs        126
Master      40
Officer     11
Royalty     10
Name: Title, dtype: int64

In [201]:
t_map={
    "Mr": 1,
    "Mrs": 1,
    "Miss": 1,
    "Master": 2,
    "Officer": 3,
    "Royalty": 4
}
e_map={
    "S": 1,
    "C": 2,
    "Q": 3
}
data2["Title"]=data2["Title"].map(t_map)
data2["Embarked"]=data2["Embarked"].map(e_map)

In [209]:
data2

     PassengerId  Survived  Pclass  ...  Embarked  Title  PassengerType
0              1         0       3  ...         1      1              4
1              2         1       1  ...         2      1              4
2              3         1       3  ...         1      1              4
3              4         1       1  ...         1      1              4
4              5         0       3  ...         1      1              4
..           ...       ...     ...  ...       ...    ...            ...
886          887         0       2  ...         1      3              4
887          888         1       1  ...         1      1              4
888          889         0       3  ...         1      1              2
889          890         1       1  ...         2      1              4
890          891         0       3  ...         3      1              4

[887 rows x 10 columns]

In [210]:
xdata = data2.drop('Survived', axis = 1)
ydata = data2.Survived

In [211]:
xtrain, xtest, ytrain, ytest, = train_test_split(xdata, ydata, test_size = 0.3, random_state = 1)

In [212]:
# DecisionTreeClassifier
clf = DecisionTreeClassifier()
clf = clf.fit(xtrain, ytrain)
ypred = clf.predict(xtest)
print("Akurasi DCS Tree : ", metrics.accuracy_score(ytest, ypred)*100)

# GaussianNaiveBeyes
gnb = GaussianNB()
gnb = gnb.fit(xtrain, ytrain)
ypredgnb = gnb.predict(xtest)
print("Akurasi Gaussian Naive Beyes : ", metrics.accuracy_score(ytest, ypredgnb)*100)

# Linear Discriminant Analysis
lda = LDA()
lda = lda.fit(xtrain, ytrain)
ypredlda = lda.predict(xtest)
print("Akurasi Linear Discriminant Analysis : ", metrics.accuracy_score(ytest, ypredlda)*100)

Akurasi DCS Tree :  72.65917602996255
Akurasi Gaussian Naive Beyes :  81.27340823970037
Akurasi Linear Discriminant Analysis :  83.52059925093633